app/views/summaries/_fields.html.erb

SELECT "users".* FROM "users" INNER JOIN "summaries_users" ON "users"."id" = "summaries_users"."user_id" WHERE "summaries_users"."summary_id" = $1  [["summary_id", 3]]
---
 			<%= f.label :users %>
			<%= select_tag "selected_user", options_from_collection_for_select(User.all, 'id', 'name',@summary.users.map{ |j| j.id }), :multiple => true %>

SELECT "sites".* FROM "sites" INNER JOIN "sites_summaries" ON "sites"."id" = "sites_summaries"."site_id" WHERE "sites_summaries"."summary_id" = $1  [["summary_id", 4]]
---
 			<%= f.label :sites %>
			<%= select_tag "selected_site", options_from_collection_for_select(Site.all, 'id', 'name',@summary.sites.map{ |j| j.id }), :multiple => true %>