app/controllers/api/v1/sites_controller.rb

  def index
  	@site = Site.all
---
SELECT "sites".* FROM "sites"

  def show
    @site = Site.all
---
SELECT  "sites".* FROM "sites"  ORDER BY "sites"."id" DESC LIMIT 1