app/controllers/sites_controller.rb

SELECT "sites".* FROM "sites"
---
	def index
		 @sites= Site.all

INSERT INTO "sites" ("name", "description", "ping", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "wo qu"], ["description", "1233"], ["ping", "123"], ["created_at", "2016-02-05 19:23:53.767666"], ["updated_at", "2016-02-05 19:23:53.767666"]]
---
	def create
		@site = Site.new(site_params)
		if @site.save

SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT 1  [["id", 1]]
---
	def edit
		@site = Site.find(params[:id])

SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "sites" SET "ping" = $1, "ip" = $2, "updated_at" = $3 WHERE "sites"."id" = $4  [["ping", "24.106"], ["ip", "72.14.195.12"], ["updated_at", "2016-02-05 21:01:39.220351"], ["id", 4]]
---
	def update
		@site = Site.find(params[:id])

		if @site.update_attributes(site_params)