app/controllers/summaries_controller.rb

	def index
		 @user= current_user
		 if current_user.admin?
		 	@summaries= Summary.all
---
SELECT "summaries".* FROM "summaries"

	def new
		@summary = Summary.new
		@user = current_user
		@sites = Site.all
---
SELECT "sites".* FROM "sites"

	def create
		@summary = Summary.new(summary_params)
		@sites = Site.where(:id => params[:selected_site])
		@summary.sites << @sites
		@users = User.where(:id => params[:selected_user])
		@summary.users << @users
		if @summary.save
---
SELECT "sites".* FROM "sites" WHERE "sites"."id" IN (1, 2)
INSERT INTO "summaries" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "asdf"], ["description", "123123"], ["user_id", 1], ["created_at", "2016-02-01 19:57:39.015069"], ["updated_at", "2016-02-01 19:57:39.015069"]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 2, 3, 4)
INSERT INTO "sites_summaries" ("site_id", "summary_id") VALUES ($1, $2) RETURNING "id"  [["site_id", 1], ["summary_id", 1]]

	def edit
		@summary = Summary.find(params[:id])
		@sites = Site.all
---
SELECT  "summaries".* FROM "summaries" WHERE "summaries"."id" = $1 LIMIT 1  [["id", 5]]
SELECT "sites".* FROM "sites"

	def update
		@summary = Summary.find(params[:id])
		@sites = Site.where(:id => params[:selected_site])
		@summary.sites.destroy_all
		@summary.sites << @sites

		@users = User.where(:id => params[:selected_user])
---
SELECT  "summaries".* FROM "summaries" WHERE "summaries"."id" = $1 LIMIT 1  [["id", 5]]
SELECT "sites".* FROM "sites" WHERE "sites"."id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9)
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11)

	def display
        @summary = Summary.find(params[:id])
---
SELECT  "summaries".* FROM "summaries" WHERE "summaries"."id" = $1 LIMIT 1  [["id", 1]]

    def destroy
        Summary.find(params[:id]).destroy
---
DELETE FROM "summaries" WHERE "summaries"."id" = $1  [["id", 1]]
SELECT  "summaries".* FROM "summaries" WHERE "summaries"."id" = $1 LIMIT 1  [["id", 1]]